{"videos":[{"videoId":"ZRnbbtqxBEc","title":"Magenta's AI Jam: Making Music with TensorFlow Models","description":"Find more information and to download links on the Magenta blog: https:\/\/goo.gl\/yoXbgf\n\nMembers of the Google Brain team have been exploring how machine learning can be used as a creative tool through a project called Magenta. In this video, members of the team give an overview of how they turned an interface that allows researchers to interactively evaluate their music generation models into a fun and powerful creative tool for musicians called \"AI Jam\". This interface won the Best Demo award at the 2017 Conference on Neural Information Processing Systems (NIPS) and is freely available on Magenta's GitHub site.  \n\nWatch more Machine Learning videos here: https:\/\/goo.gl\/KewA03\n\nSubscribe to the Google Developers Channel: http:\/\/goo.gl\/mQyv5","channelTitle":"Google Developers","thumbnail":"https:\/\/i.ytimg.com\/vi\/ZRnbbtqxBEc\/mqdefault.jpg","viewCount":"20695"},{"videoId":"kaPheQxIsPY","title":"Introduction to TensorFlow Lattice","description":"Check out Gitbub Repo for instructions and examples: https:\/\/goo.gl\/LbVVPh\nAlso take a look at the Deep Lattice Networks publication for mathematical details: https:\/\/goo.gl\/REE6cb\n\nMaya Gupta, Seungil You and Jan Pfeifer introduce TensorFlow Lattice. TensorFlow Lattice is an open source project that provides a set of prebuilt TensorFlow Estimators that are easy to use, and TensorFlow operators to build your own lattice models. Lattices are multi-dimensional interpolated look-up tables that can approximate any input-output relationships in your data. Furthermore, TensorFlow Lattice provides a way to impose a monotonic input-output relationship (an input goes up, then the output goes up) and smooth regularizers including Laplacian, Torsion to help your model generalize better for unseen feature space. \n\nSubscribe to the Google Developers Channel: http:\/\/goo.gl\/mQyv5L","channelTitle":"Google Developers","thumbnail":"https:\/\/i.ytimg.com\/vi\/kaPheQxIsPY\/mqdefault.jpg","viewCount":"18120"},{"videoId":"OzAdKMPgUt4","title":"TensorFlow Frontiers (Google I\/O '17)","description":"TensorFlow is an open-source machine learning (ML) platform that is fast, flexible, and production-ready. We'll cover recent advances in the TensorFlow ecosystem with a focus on performance.\n\nSee all the talks from Google I\/O '17 here: https:\/\/goo.gl\/D0D4VE\nWatch more Android talks at I\/O '17 here: https:\/\/goo.gl\/c0LWYl\nWatch more Chrome talks at I\/O '17 here: https:\/\/goo.gl\/Q1bFGY\nWatch more Firebase talks at I\/O '17 here: https:\/\/goo.gl\/pmO4Dr\n\nSubscribe to the Google Developers channel: http:\/\/goo.gl\/mQyv5L\n\n#io17 #GoogleIO #GoogleIO2017","channelTitle":"Google Developers","thumbnail":"https:\/\/i.ytimg.com\/vi\/OzAdKMPgUt4\/mqdefault.jpg","viewCount":"19308"},{"videoId":"25ISTLhz0ys","title":"Android Meets TensorFlow: How to Accelerate Your App with AI (Google I\/O '17)","description":"Portability is one of the main benefits of TensorFlow -- you can easily move a neural network model to Android and run predictions on mobile phones, for all kinds of AI tricks from image recognition to motion recognition. But models are often large (tens of megabytes) and prediction can consume lots of CPU power. In this session, we'll share tips and tricks on overcoming these challenges so you can bring the latest AI technologies to your Android app.\n\nSee all the talks from Google I\/O '17 here: https:\/\/goo.gl\/D0D4VE\nWatch more Android talks at I\/O '17 here: https:\/\/goo.gl\/c0LWYl\nWatch more Chrome talks at I\/O '17 here: https:\/\/goo.gl\/Q1bFGY\nWatch more Firebase talks at I\/O '17 here: https:\/\/goo.gl\/pmO4Dr\n\nSubscribe to the Google Developers channel: http:\/\/goo.gl\/mQyv5L\n\n#io17 #GoogleIO #GoogleIO2017","channelTitle":"Google Developers","thumbnail":"https:\/\/i.ytimg.com\/vi\/25ISTLhz0ys\/mqdefault.jpg","viewCount":"32520"},{"videoId":"sqYdlSF0BI8","title":"From Research to Production with TensorFlow Serving (Google I\/O '17)","description":"Learn how to bring your TensorFlow models from research to production. In this talk, Noah Fiedel describes how to export and serve your models at scale with TensorFlow Serving. He will also cover best practices and lessons learned from large scale serving of machine learned models.\n\nSee all the talks from Google I\/O '17 here: https:\/\/goo.gl\/D0D4VE\nWatch more Android talks at I\/O '17 here: https:\/\/goo.gl\/c0LWYl\nWatch more Chrome talks at I\/O '17 here: https:\/\/goo.gl\/Q1bFGY\nWatch more Firebase talks at I\/O '17 here: https:\/\/goo.gl\/pmO4Dr\n\nSubscribe to the Google Developers channel: http:\/\/goo.gl\/mQyv5L\n\n#io17 #GoogleIO #GoogleIO2017","channelTitle":"Google Developers","thumbnail":"https:\/\/i.ytimg.com\/vi\/sqYdlSF0BI8\/mqdefault.jpg","viewCount":"12213"}],"pagination":{"nextPage":"CAoQAA","prevPage":"CAUQAQ","totalResults":25,"resultsPerPage":5}}